---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.CyclesPerSecond
source: html/9489da8e-f147-3547-daa1-eed535bb8f1e.htm
---
# Autodesk.Revit.DB.UnitTypeId.CyclesPerSecond Property

Cycles per second.

## Syntax (C#)
```csharp
public static ForgeTypeId CyclesPerSecond { get; }
```